Tekla.Structures.Catalogs.MaterialItem
The MaterialItem class contains information about the materials in the Tekla Structures catalog.

Tekla.Structures.Catalogs.MaterialItem.#ctor
Creates a new material item instance.

Tekla.Structures.Catalogs.MaterialItem.MaterialName
The material item's name.

Tekla.Structures.Catalogs.MaterialItem.AliasName1
The material item's alias name 1.

Tekla.Structures.Catalogs.MaterialItem.AliasName2
The material item's alias name 2.

Tekla.Structures.Catalogs.MaterialItem.AliasName3
The material item's alias name 3.

Tekla.Structures.Catalogs.MaterialItem.Type
The material item's type.

Tekla.Structures.Catalogs.MaterialItem.ProfileDensity
The profile density in unit kg/m3.

Tekla.Structures.Catalogs.MaterialItem.PlateDensity
The plate density in unit kg/m3.

Tekla.Structures.Catalogs.MaterialItem.ModulusOfElasticity
Thte modulus of elasticity in unit N/m2.

Tekla.Structures.Catalogs.MaterialItem.PoissonsRatio
The poissons ratio

Tekla.Structures.Catalogs.MaterialItem.ThermalDilatation
The thermal dilatation in unit 1/K.

Tekla.Structures.Catalogs.MaterialItem.DesignCode
The design code.

Tekla.Structures.Catalogs.MaterialItem.MaterialNameMaxLength
Returns the maximum length a material name can be.
Returns: The maximum length.

Tekla.Structures.Catalogs.MaterialItem.Select(System.String)
Selects the material item based on the name from the material database.
The material name can also be an alias name.
materialName: The name or alias name of the material.
Returns: True on success. False if the material was not found.

Tekla.Structures.Catalogs.MaterialItem.Select
Selects the material item from the database based on the material name and alias name
in this instance.
Returns: True on success. False if the material was not found.

Tekla.Structures.Catalogs.MaterialItem.Insert
Inserts this material item to material database.
Returns:
True on success. False if operation failed. Possible reasons: material name is invalid;
a material with the same name already exists in database.

Tekla.Structures.Catalogs.MaterialItem.Modify
Modifies the material in material database that has the same name as this instance.
Returns:
True on success. False if operation failed. Possible reasons:
a material with the name of this does not exist in database.

Tekla.Structures.Catalogs.MaterialItem.Delete
Delete this material from material database.
Returns:
True on success. False if operation failed. Possible reasons:
a material with the name of this does not exist in database.

Tekla.Structures.Catalogs.MaterialItem.Export(System.String@)
Exports the material item in the material database to given file name.
Materials are exported to *.lis format.
If path is not given material is exported to model folder.
If filename is empty material name is used as filename.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
MaterialItem item = new MaterialItem();
if (item.Select("S235JR"))
{
string filename = System.IO.Path.GetTempPath() + "\\" + "S235JR";
if (item.Export(ref filename))
{
Console.WriteLine("S235JR material exported successfully");
}
}
}
}
filename: The export file name of the material item.
Returns: True on success.

Tekla.Structures.Catalogs.MaterialItem.Exists
Tells whether the database contains a material with the name of this instance.
Returns: True if a material with the name exists in database.